[{"title":"旧事 人世长殊，缅怀长苏 6.2-6.3","date":"2017-06-02T08:46:00.000Z","path":"2017/06/02/diary-2017-0602-0603/","text":"​​​隐忍坚守，十三年后，又回到了过去。正如蔺晨所言：“地狱归来，不可久留”，梅长苏做回了林殊，将人生的最后记忆留给了林殊(或者说是在和过去告别)。 慧极必伤梅岭冰雪交汇之地。正如林殊与梅长苏之比。一个鲜衣怒马，少年得志；一个体弱多病，阴暗诡谲。赤焰军葬生冰雪皑皑的梅林，林殊也从那时死去。江左梅郎，麒麟才子，得之可得天下，这是他为重回京城制造的舆论。搓骨削皮有多痛，不白之冤有多恨，都隐在了他不喜不惊的外表之下，酝酿着，搅动风云的苦心经营中。权谋，夺嫡，步步惊心。金陵的冬天漫长而又寒冷，。披风，暖炉，火盆，中药，寸步不离，每每看到大雪飞舞都怕他下一秒倒下。靖王好歹可以保持本心，只做自己，看不起玩弄权术之人，正直的近乎执拗。而梅长苏与靖王那么的相似却要做自己当初最讨厌的那一类人。步步为营，攻于心计。另一步很喜欢的剧是《甄嬛传》，同样的制作精美，剧情精彩。但《甄嬛传》看到了最后却让人心寒。姐妹反目，夫妻成仇，主仆失恩。一个人要想活着，就要如何的谋划，甚至不惜利用他人，将厚黑演绎到极致，最后变得面目全非，丢了自己。关于未来也是那么的无望。那什么是胜利？只是活着？那不是或者，是苟且偷生。绝对的权利才是胜利，而《琅琊榜》的绝对权威却是真理，就算权利也不能干预真理，被压制的真理只会迟到却不会不来。越看到后面却让人觉得热血沸腾。头一次发现权术也是一种智慧。一种揭穿阴谋，匡扶正义，开创公平的智慧。权术本身并不是弄权，而是更公平，透明的用权。所以梅长苏建议靖王不必过早培植党羽，真心与诤臣相交就好；所以梅长苏阻止言侯爷炸死皇帝，因为弄死一个人不是复仇的目的，而真相，清白，名誉，才是根本。这部剧有太多的正能量，和人性的温暖。比如景琰对袍泽战友的绝对信任和忠诚；比如霓凰对青梅竹马的怀念和等待；冬姐的夫妻情深，比如言侯爷苟利国家生死以，仗节深入敌营谈判的铁胆忠心；比如景睿对朋友的仗义支持，被利用后的宽容淡然；比如飞流虽然智力有限却很努力的保护他认可的人；比如静妃发现宫中奸细还是没有要她性命；比如蔡荃怒发冲冠为了皇帝只在于众皇子的党争，却对100多条人命不闻不问；比如蔺晨就算平时打打闹闹很没正经，就算劝不住梅长苏从军也陪他出征，陪他最后一刻。。。就连反面人物谢玉，也有心里一直坚持着的对莅阳的爱。“天下是天下人的天下”；“你可以不相信情意，但不要藐视情意，否则最终被其所灭”；“持身要正，持心要纯”。。。这些台词都引起了我的思考。关于对错，滑族公主，处心积虑，设计赤焰军，可在她们的角度，何尝不是一种正义？夏江说“只有活着才是一切？”梅长苏说“如果取他人性命为自己存活，活着也没了意义。”誉王说处事要学会平衡各部，经营关系，靖王却说，朝廷自有朝廷的法度，这些经营圆滑，现在不会，以后也永远不会学；谢玉说成王败寇，胜利了才有资格说对错，景睿说不违本心，只做自己认为对的事情。。。难道理想走向现实就一定必须屈从自己不认同的价值观吗？《琅琊榜》除了它的苏，和颜值强大，让我喜欢，它的立意和情怀更让我着迷。梅长苏最终透支了生命，在最后的日子里做回了林殊。我想他是愿意的。重新“能挽大弓，能降烈马”，能写回霓凰熟悉的笔锋有力的字，不用在围着火盆愤恨自己冷如冰雪，如今虚弱，只能在阴暗的地狱搅弄风云。穿上戎装的时候，他又回去了以前的如火少年，那么的义气奋发。老皇帝在最后说，“你可曾记得我曾抱过你，带你玩，带你放风筝。”灭族之恨梅长苏只是含泪离去，不曾回头。人生若只如初见。当上皇帝的靖王再不是当年的景琰，君心多变。不如在怀念中留下最美好的样子。红衣少年，白衫书生。梅岭有烈焰有寒雪，埋葬了林殊。 很佩服他内心的坚毅，过去的他策马扬鞭，意气风发。当遇见景睿时，好比曾经的自己，依旧可以利用，背负一切罪名。可当他做回了林殊，却注定死亡。 情深不寿人生过得很精彩，很完美，却因为过于精彩而放弃了陪伴朋友，爱人。终了之时，一句“此生一诺，来世必践”，谢幕了悲剧的精彩。www.zhihu.com/question/39052377 下一世，他会怎样呢？ 如果来世霓凰还记着等他，我相信他会伴其一生，白首相依；如果他没找到她，必会保护好自己，一直等下去吧。 对所有东西不要过分喜欢，切勿为而不为。无为而为，诀而行之岂不走的更加稳重，更加现实。","tags":[{"name":"旧事","slug":"旧事","permalink":"http://yoursite.com/tags/旧事/"},{"name":"随记","slug":"随记","permalink":"http://yoursite.com/tags/随记/"}]},{"title":"旧事 曾经的愿望 4.10-4.16","date":"2017-04-16T02:36:00.000Z","path":"2017/04/16/diary-2017-0410-0416/","text":"当时想着考上研究生，就可以放下手中的笔，与键盘相依相伴，虚拟在线办公。把电脑当分为主系统娱乐和多个分系统独立的工作室。忘却一切烦恼与不安，去自己想去的地方看那些陌生的风景。 当计划被打乱，梦想被搁浅时，还要在凡间呆上一年，渡渡劫难 买台台式机，多买几个显示器，这样工作学习起来就方便多了，多装几个虚拟机，配置各种不同的环境，配远程，以后就可以完全的随时随地远程办公，最重要的是工作完后可以继续以一个孩子的心态去玩耍。可必须成熟，责任还有去承担，你是男生，没有任性的资本女生还可以随随便便找个工作，以后期望着婚姻能够改变命运，而男生，必须去担当了孩子的幼稚，想象力是许多成人都不具备的，网络时代亦如此鱼与熊掌不可兼得当你拿到offer时，却发现这个岗位你真的不喜欢，再坚持一年，一定坚持，时间到了，不管喜不喜欢，该干嘛干嘛 做每一个项目，你都能找到最快的方法，不读研，找工作我很难找的提升自己的机会,再考一年，如果再报西邮，就真的一点追求都没有，自己也没动力 二战西电的这一年你该如何度过？ 是想过去那样打打擦边球，然后用剩余时间去记录自己的一些关于计算机体系的一些想法还是沉浸于答案套路的海洋，我，没有选择 很遗憾没能读陈莉君老师的研究生 对不起她，机试面试都还算不错，期望着在她坛求道，聆听大师对计算机体系，大数据安全的理解，对内核的感悟，对哲学禅学等的一些心得体会。命运如此，能否扼住她的喉咙？以后做事情细心点，慢点，别一直为那些为那些闲余时间被浪费而感到遗憾。 做一个好吃懒做贪财好色的人不好吗 稳稳当当的 把自己应该做的事情先做完，然后再考虑自己喜欢做的。至少稳定点，只是可能会牺牲所谓的一些创新能力，但至少会变得稳定了许多，对家庭好。 还没到愿望实现的时候时 Back with silence","tags":[{"name":"旧事","slug":"旧事","permalink":"http://yoursite.com/tags/旧事/"}]},{"title":"Hello World","date":"2014-03-22T17:49:00.000Z","path":"2014/03/23/hello-world/","text":"它像是属于我们自己的一块小小领地，因而满足于这种归属感。我们愿在上面安静劳作。","tags":[{"name":"简介","slug":"简介","permalink":"http://yoursite.com/tags/简介/"}]}]