[{"title":"Kernel前辈教C小子探案  3.18-3.20","date":"2018-03-20T05:05:00.000Z","path":"2018/03/20/diary-2018-0318-0320/","text":"111与221C小子：int main(){int n=1;printf(&quot;%d %d %d\\n&quot;,n,++n,n--);}Kernel前辈，请问它怎么在不同的编译器下答案不一样Kernel前辈:C小子，你自己的答案是什么？C小子：官方答案1 1 1Kernel前辈:为什么会不一样，这很有意思。回答一下这个问题C小子：好Kernel前辈:学习Linux内核，需要具备的知识基础，非常熟练的C，数据结构，编译原理，操作系统，软件工程，计算机原理，如果要了解网络，还需要网络知识。如果没有这些基础，真的学的很痛苦，就像空中楼阁，还有汇编语言。考试与实际代码还有相当的距离的，你看过Linux的一点代码，应该有感觉的。还有shell脚本语言C小子：是的，坚持了理论有时就要放弃实践，坚持了实践就有时就要放弃理论。shell之前也写过Kernel前辈:学内核这块，必须在理论和实践之间来回转换，因为，必须拿出东西才能给自己信心C小子：是的。技术是基本功!C小子：#include &lt;stdio.h&gt;int main(){ int n=1; printf(&quot;%d %d %d\\n&quot;,n,++n,n--);} vc++ ：2 2 1Turbo C: 1 1 1 VC++环境下连续自增(自减)运算规则在一般表达式中和在函数参数中计算的结果相同;规则：1.先参考运算优先级;（++n的优先级高）2.然后再从右至左依次对每个表达式求解;（n–=1，n=1;++n=2，n=2;n=2）3.然后再从左到右输出每个表达式的值;（2 2 1 ）4.最后变量n的值再自减1次。 Turbo C环境中当自增、自减运算出现在函数参数中时，计算方法采用扫描格式决定;规则：1.Turbo C编译环境中在从右至左依次对每个表达式求解时，先得到n–的值，然后n的值减1;（n–=1，n=0）2.然后n加上1，得到++n的值;（n=0+1=1,++n=1）3.最后n为1。（n=1）C小子：Kernel前辈:（1）把这些汇编指令解释一下 （2）从编译角度说明二者这样做的理以及带来的问题 （3）在实际项目中遇到这样的问题如何解决 （4）在Linux 下运行看看结果 （5）谁遵循了标准 CC小子：好的C小子：（1）把这些汇编指令解释一下汇编代码： int n=1;00401028 mov dword ptr [ebp-4],1//将1存放到ebp-4中，ebp-4此时为1 printf(&quot;%d %d %d\\n&quot;,n,++n,n--);// 2 2 10040102F mov eax,dword ptr [ebp-4]//把ebp-4的值存放到寄存器eax中，eax此时为100401032 mov dword ptr [ebp-8],eax//将寄存器的值存放到地址为ebp-8的临时量中，此临时量ebp-8保存的值是100401035 mov ecx,dword ptr [ebp-8]//将ebp-8的值存放到寄存器ecx中，ecx此时是100401038 push ecx//将ecx的值压入栈中，100401039 mov edx,dword ptr [ebp-4]//将ebp-4的值放到edx中，edx此时为10040103C add edx,1//对寄存器edx的值进行+1操作，edx为20040103F mov dword ptr [ebp-4],edx//将寄存器edx的值重新写到ebp-4中，ebp-4此时为200401042 mov eax,dword ptr [ebp-4]//将ebp-4的值取出来放到寄存器eax中，eax为200401045 push eax//将eax的值压入栈中,1 200401046 mov ecx,dword ptr [ebp-4]//将ebp-4的值放到ecx中，ecx为200401049 push ecx////将ecx的值压入栈中， 1 2 20040104A push offset string &quot;%d&quot; (0042201c)//压入字符串参数0040104F mov edx,dword ptr [ebp-4]//将ebp-4的值放到edx中，edx 为200401052 sub edx,1//对edx寄存器进行-1操作，edx 为100401055 mov dword ptr [ebp-4],edx//将eax放到ebp-4中00401058 call printf (00401090)//开始执行printf函数 2 2 10040105D add esp,10h//释放局部变量空间 （2）从编译角度说明二者这样做的理由以及带来的问题理由：编译时不同编译器处理方法不同，在vc++中编译时，需要考虑优先级，（add edx,1）。编译角度很底层，规则不同，或许是因为更底层的一些东西限制，我再查查 问题：会出现歧义， 使得一些程序不能很好的移植，不能跨平台使用 （3）在实际项目中遇到这样的问题如何解决应避免歧义，以稳定兼容为原则，将自增自减运算用变量代替，根据要求改写,可写成：#include &lt;stdio.h&gt;int main(){ int i,j,k; int n=1; i=n; j=++n; k=n--; printf(&quot;%d %d %d\\n&quot;,n,++n,n--);} （4）在Linux 下运行看看结果1 1 1（5）谁遵循了标准 Clinux 下的编译器gcc遵循了标准 cKernel前辈:回答的不错，还有一个问题，为什么要压栈？C小子：压栈可能是为何后面便于一条输出语句可以输出多个结果吧Kernel前辈:不对C小子：那是为什么呀，从右向左的压栈，从左向右的输出，多个结果保证顺序。编译系统我不是非常了解Kernel前辈:手上要有一本深入理解计算机系统的书，查看函数的执行过程就明白了C小子：嗯嗯，我了解的深度不够Kernel前辈:不是不够，皮毛尚未触及Kernel前辈:刚才你回答问题的思路和方法是正确的C小子：Kernel前辈，虽然我用户态的程序不太了解，但不是完全不可用学内核，只要方法正确，对比着学，内核态用户态相互验证，这样更好。那到底为什么要压栈呀？Kernel前辈:这个需要你系统的去了解，不能等答案。会涉及到编译程序如何对函数进程编译处理。执行程序如何执行函数C小子：是一种约定的规则Kernel前辈:对，计算机中有很多的标准和接口C小子：会不会编译程序对函数处理 在不同的条件下也不同，就像不同的编译器那个程序结果也不同。就是说有不同的规则Kernel前辈:编译器不一样，处理规则上有差异C小子：好有意思呀，一切可定义Kernel前辈:但业界也有统一标准，这些标准相当于基类，是最低原则，各家还会定自己的规则C小子：各家自己定义是为了便于自己的一些应用，统一标准是为了传播交流。多谢Kernel前辈指点。 20001与19496Kernel前辈:一个加1操作就可以把计算机方方面面的知识都带出来。加1操作系统会引发很多有趣的话题，在并发环境下又发生什么不可思议的事？写一个简单的程序，两个线程共享变量n, 初值为1，分别对N加1000次后，结果是什么，为什么C小子：#include &lt;stdio.h&gt;#include &quot;windows.h&quot;int n = 1;bool p1 = false;bool p2 = false;DWORD WINAPI proc1(LPVOID lparentet){for(int i = 0;i&lt;1000;i++){n++;}p1= true;return 0;}DWORD WINAPI proc2(LPVOID lparentet){for(int i = 0;i&lt;1000;i++){n++;}p2 = true;return 0;}int main(){CreateThread(NULL,0,proc1,NULL,0,NULL);CreateThread(NULL,0,proc2,NULL,0,NULL);while(1){if(p1 &amp;&amp; p2){printf(&quot;%d\\n&quot;,n);break;}}return 0;}1000次，运行结果一直都是2001，没有发现异常，但是1W次有时会有异常，按理说是20001，但有时就是其它数，10W次的话经常异常。好奇怪，次数越多，异常现象越明显1000次很难发现异常。这和处理器性能有没有关系？Kernel前辈:这个问题，自己探索，如果方向对了，再给你说C小子：好，会不会是一个线程访问这个全局变量时而另一个线程将其修改，从而产生异常。而异常结果小于正常结果是因为是n++这个运算。如果是n–则会大于正常结果。异常结果与正常结果之差不一定是发生异常的次数，一个线程访问这个全局变量时而另一个线程或许会将其修改再修改。次数越多，异常现象越明显，这和处理器性能应该没有关系，因为执行的次数一定。全局变量为1，n– 1000次后应是-1999，异常结果大于正常结果Kernel前辈:从线程的并发执行考虑C小子：一个线程访问这个全局变量时而另一个线程将其修改，从而产生异常Kernel前辈:同步机制C小子：多谢Kernel前辈指点Kernel前辈:为什么异常还没说到根本上C小子：没有上锁，经常无序执行，虽然效率高，但是容易出错。再次感谢Kernel前辈的指点。","tags":[{"name":"Kernel","slug":"Kernel","permalink":"//litten.me/tags/Kernel/"}]},{"title":"旧事 人世长殊，缅怀长苏 6.2-6.3","date":"2017-06-02T08:46:00.000Z","path":"2017/06/02/diary-2017-0602-0603/","text":"​​​隐忍坚守，十三年后，又回到了过去。正如蔺晨所言：“地狱归来，不可久留”，梅长苏做回了林殊，将人生的最后记忆留给了林殊(或者说是在和过去告别)。 慧极必伤梅岭冰雪交汇之地。正如林殊与梅长苏之比。一个鲜衣怒马，少年得志；一个体弱多病，阴暗诡谲。赤焰军葬生冰雪皑皑的梅林，林殊也从那时死去。江左梅郎，麒麟才子，得之可得天下，这是他为重回京城制造的舆论。搓骨削皮有多痛，不白之冤有多恨，都隐在了他不喜不惊的外表之下，酝酿着，搅动风云的苦心经营中。权谋，夺嫡，步步惊心。金陵的冬天漫长而又寒冷，。披风，暖炉，火盆，中药，寸步不离，每每看到大雪飞舞都怕他下一秒倒下。靖王好歹可以保持本心，只做自己，看不起玩弄权术之人，正直的近乎执拗。而梅长苏与靖王那么的相似却要做自己当初最讨厌的那一类人。步步为营，攻于心计。另一步很喜欢的剧是《甄嬛传》，同样的制作精美，剧情精彩。但《甄嬛传》看到了最后却让人心寒。姐妹反目，夫妻成仇，主仆失恩。一个人要想活着，就要如何的谋划，甚至不惜利用他人，将厚黑演绎到极致，最后变得面目全非，丢了自己。关于未来也是那么的无望。那什么是胜利？只是活着？那不是或者，是苟且偷生。绝对的权利才是胜利，而《琅琊榜》的绝对权威却是真理，就算权利也不能干预真理，被压制的真理只会迟到却不会不来。越看到后面却让人觉得热血沸腾。头一次发现权术也是一种智慧。一种揭穿阴谋，匡扶正义，开创公平的智慧。权术本身并不是弄权，而是更公平，透明的用权。所以梅长苏建议靖王不必过早培植党羽，真心与诤臣相交就好；所以梅长苏阻止言侯爷炸死皇帝，因为弄死一个人不是复仇的目的，而真相，清白，名誉，才是根本。这部剧有太多的正能量，和人性的温暖。比如景琰对袍泽战友的绝对信任和忠诚；比如霓凰对青梅竹马的怀念和等待；冬姐的夫妻情深，比如言侯爷苟利国家生死以，仗节深入敌营谈判的铁胆忠心；比如景睿对朋友的仗义支持，被利用后的宽容淡然；比如飞流虽然智力有限却很努力的保护他认可的人；比如静妃发现宫中奸细还是没有要她性命；比如蔡荃怒发冲冠为了皇帝只在于众皇子的党争，却对100多条人命不闻不问；比如蔺晨就算平时打打闹闹很没正经，就算劝不住梅长苏从军也陪他出征，陪他最后一刻。。。就连反面人物谢玉，也有心里一直坚持着的对莅阳的爱。“天下是天下人的天下”；“你可以不相信情意，但不要藐视情意，否则最终被其所灭”；“持身要正，持心要纯”。。。这些台词都引起了我的思考。关于对错，滑族公主，处心积虑，设计赤焰军，可在她们的角度，何尝不是一种正义？夏江说“只有活着才是一切？”梅长苏说“如果取他人性命为自己存活，活着也没了意义。”誉王说处事要学会平衡各部，经营关系，靖王却说，朝廷自有朝廷的法度，这些经营圆滑，现在不会，以后也永远不会学；谢玉说成王败寇，胜利了才有资格说对错，景睿说不违本心，只做自己认为对的事情。。。难道理想走向现实就一定必须屈从自己不认同的价值观吗？《琅琊榜》除了它的苏，和颜值强大，让我喜欢，它的立意和情怀更让我着迷。梅长苏最终透支了生命，在最后的日子里做回了林殊。我想他是愿意的。重新“能挽大弓，能降烈马”，能写回霓凰熟悉的笔锋有力的字，不用在围着火盆愤恨自己冷如冰雪，如今虚弱，只能在阴暗的地狱搅弄风云。穿上戎装的时候，他又回去了以前的如火少年，那么的义气奋发。老皇帝在最后说，“你可曾记得我曾抱过你，带你玩，带你放风筝。”灭族之恨梅长苏只是含泪离去，不曾回头。人生若只如初见。当上皇帝的靖王再不是当年的景琰，君心多变。不如在怀念中留下最美好的样子。红衣少年，白衫书生。梅岭有烈焰有寒雪，埋葬了林殊。 很佩服他内心的坚毅，过去的他策马扬鞭，意气风发。当遇见景睿时，好比曾经的自己，依旧可以利用，背负一切罪名。可当他做回了林殊，却注定死亡。 情深不寿人生过得很精彩，很完美，却因为过于精彩而放弃了陪伴朋友，爱人。终了之时，一句“此生一诺，来世必践”，谢幕了悲剧的精彩。www.zhihu.com/question/39052377 下一世，他会怎样呢？ 如果来世霓凰还记着等他，我相信他会伴其一生，白首相依；如果他没找到她，必会保护好自己，一直等下去吧。 对所有东西不要过分喜欢，切勿为而不为。无为而为，诀而行之岂不走的更加稳重，更加现实。","tags":[{"name":"旧事","slug":"旧事","permalink":"//litten.me/tags/旧事/"},{"name":"随记","slug":"随记","permalink":"//litten.me/tags/随记/"}]},{"title":"安全 中华人民共和国网络安全法 5.28-6.1","date":"2017-06-01T02:36:00.000Z","path":"2017/06/01/diary-2017-0528-0601/","text":"中华人民共和国网络安全法(2016年11月7日第十二届全国人民代表大会常务委员会第二十四次会议通过,2017年6月1日正式实施） 目 录 第一章 总 则 第二章 网络安全支持与促进 第三章 网络运行安全 第一节 一般规定 第二节 关键信息基础设施的运行安全 第四章 网络信息安全 第五章 监测预警与应急处置 第六章 法律责任 第七章 附 则 第一章 总 则第一条 为了保障网络安全，维护网络空间主权和国家安全、社会公共利益，保护公民、法人和其他组织的合法权益，促进经济社会信息化健康发展，制定本法。第二条 在中华人民共和国境内建设、运营、维护和使用网络，以及网络安全的监督管理，适用本法。第三条 国家坚持网络安全与信息化发展并重，遵循积极利用、科学发展、依法管理、确保安全的方针，推进网络基础设施建设和互联互通，鼓励网络技术创新和应用，支持培养网络安全人才，建立健全网络安全保障体系，提高网络安全保护能力。第四条 国家制定并不断完善网络安全战略，明确保障网络安全的基本要求和主要目标，提出重点领域的网络安全政策、工作任务和措施。第五条 国家采取措施，监测、防御、处置来源于中华人民共和国境内外的网络安全风险和威胁，保护关键信息基础设施免受攻击、侵入、干扰和破坏，依法惩治网络违法犯罪活动，维护网络空间安全和秩序。第六条 国家倡导诚实守信、健康文明的网络行为，推动传播社会主义核心价值观，采取措施提高全社会的网络安全意识和水平，形成全社会共同参与促进网络安全的良好环境。第七条 国家积极开展网络空间治理、网络技术研发和标准制定、打击网络违法犯罪等方面的国际交流与合作，推动构建和平、安全、开放、合作的网络空间，建立多边、民主、透明的网络治理体系。第八条 国家网信部门负责统筹协调网络安全工作和相关监督管理工作。国务院电信主管部门、公安部门和其他有关机关依照本法和有关法律、行政法规的规定，在各自职责范围内负责网络安全保护和监督管理工作。县级以上地方人民政府有关部门的网络安全保护和监督管理职责，按照国家有关规定确定。第九条 网络运营者开展经营和服务活动，必须遵守法律、行政法规，尊重社会公德，遵守商业道德，诚实信用，履行网络安全保护义务，接受政府和社会的监督，承担社会责任。第十条 建设、运营网络或者通过网络提供服务，应当依照法律、行政法规的规定和国家标准的强制性要求，采取技术措施和其他必要措施，保障网络安全、稳定运行，有效应对网络安全事件，防范网络违法犯罪活动，维护网络数据的完整性、保密性和可用性。第十一条 网络相关行业组织按照章程，加强行业自律，制定网络安全行为规范，指导会员加强网络安全保护，提高网络安全保护水平，促进行业健康发展。第十二条 国家保护公民、法人和其他组织依法使用网络的权利，促进网络接入普及，提升网络服务水平，为社会提供安全、便利的网络服务，保障网络信息依法有序自由流动。任何个人和组织使用网络应当遵守宪法法律，遵守公共秩序，尊重社会公德，不得危害网络安全，不得利用网络从事危害国家安全、荣誉和利益，煽动颠覆国家政权、推翻社会主义制度，煽动分裂国家、破坏国家统一，宣扬恐怖主义、极端主义，宣扬民族仇恨、民族歧视，传播暴力、淫秽色情信息，编造、传播虚假信息扰乱经济秩序和社会秩序，以及侵害他人名誉、隐私、知识产权和其他合法权益等活动。第十三条 国家支持研究开发有利于未成年人健康成长的网络产品和服务，依法惩治利用网络从事危害未成年人身心健康的活动，为未成年人提供安全、健康的网络环境。第十四条 任何个人和组织有权对危害网络安全的行为向网信、电信、公安等部门举报。收到举报的部门应当及时依法作出处理；不属于本部门职责的，应当及时移送有权处理的部门。有关部门应当对举报人的相关信息予以保密，保护举报人的合法权益。第二章 网络安全支持与促进第十五条 国家建立和完善网络安全标准体系。国务院标准化行政主管部门和国务院其他有关部门根据各自的职责，组织制定并适时修订有关网络安全管理以及网络产品、服务和运行安全的国家标准、行业标准。国家支持企业、研究机构、高等学校、网络相关行业组织参与网络安全国家标准、行业标准的制定。第十六条 国务院和省、自治区、直辖市人民政府应当统筹规划，加大投入，扶持重点网络安全技术产业和项目，支持网络安全技术的研究开发和应用，推广安全可信的网络产品和服务，保护网络技术知识产权，支持企业、研究机构和高等学校等参与国家网络安全技术创新项目。第十七条 国家推进网络安全社会化服务体系建设，鼓励有关企业、机构开展网络安全认证、检测和风险评估等安全服务。第十八条 国家鼓励开发网络数据安全保护和利用技术，促进公共数据资源开放，推动技术创新和经济社会发展。国家支持创新网络安全管理方式，运用网络新技术，提升网络安全保护水平。第十九条 各级人民政府及其有关部门应当组织开展经常性的网络安全宣传教育，并指导、督促有关单位做好网络安全宣传教育工作。大众传播媒介应当有针对性地面向社会进行网络安全宣传教育。第二十条 国家支持企业和高等学校、职业学校等教育培训机构开展网络安全相关教育与培训，采取多种方式培养网络安全人才，促进网络安全人才交流。第三章 网络运行安全第一节 一般规定第二十一条 国家实行网络安全等级保护制度。网络运营者应当按照网络安全等级保护制度的要求，履行下列安全保护义务，保障网络免受干扰、破坏或者未经授权的访问，防止网络数据泄露或者被窃取、篡改：（一）制定内部安全管理制度和操作规程，确定网络安全负责人，落实网络安全保护责任；（二）采取防范计算机病毒和网络攻击、网络侵入等危害网络安全行为的技术措施；（三）采取监测、记录网络运行状态、网络安全事件的技术措施，并按照规定留存相关的网络日志不少于六个月；（四）采取数据分类、重要数据备份和加密等措施；（五）法律、行政法规规定的其他义务。第二十二条 网络产品、服务应当符合相关国家标准的强制性要求。网络产品、服务的提供者不得设置恶意程序；发现其网络产品、服务存在安全缺陷、漏洞等风险时，应当立即采取补救措施，按照规定及时告知用户并向有关主管部门报告。网络产品、服务的提供者应当为其产品、服务持续提供安全维护；在规定或者当事人约定的期限内，不得终止提供安全维护。网络产品、服务具有收集用户信息功能的，其提供者应当向用户明示并取得同意；涉及用户个人信息的，还应当遵守本法和有关法律、行政法规关于个人信息保护的规定。第二十三条 网络关键设备和网络安全专用产品应当按照相关国家标准的强制性要求，由具备资格的机构安全认证合格或者安全检测符合要求后，方可销售或者提供。国家网信部门会同国务院有关部门制定、公布网络关键设备和网络安全专用产品目录，并推动安全认证和安全检测结果互认，避免重复认证、检测。第二十四条 网络运营者为用户办理网络接入、域名注册服务，办理固定电话、移动电话等入网手续，或者为用户提供信息发布、即时通讯等服务，在与用户签订协议或者确认提供服务时，应当要求用户提供真实身份信息。用户不提供真实身份信息的，网络运营者不得为其提供相关服务。国家实施网络可信身份战略，支持研究开发安全、方便的电子身份认证技术，推动不同电子身份认证之间的互认。第二十五条 网络运营者应当制定网络安全事件应急预案，及时处置系统漏洞、计算机病毒、网络攻击、网络侵入等安全风险；在发生危害网络安全的事件时，立即启动应急预案，采取相应的补救措施，并按照规定向有关主管部门报告。第二十六条 开展网络安全认证、检测、风险评估等活动，向社会发布系统漏洞、计算机病毒、网络攻击、网络侵入等网络安全信息，应当遵守国家有关规定。第二十七条 任何个人和组织不得从事非法侵入他人网络、干扰他人网络正常功能、窃取网络数据等危害网络安全的活动；不得提供专门用于从事侵入网络、干扰网络正常功能及防护措施、窃取网络数据等危害网络安全活动的程序、工具；明知他人从事危害网络安全的活动的，不得为其提供技术支持、广告推广、支付结算等帮助。第二十八条 网络运营者应当为公安机关、国家安全机关依法维护国家安全和侦查犯罪的活动提供技术支持和协助。第二十九条 国家支持网络运营者之间在网络安全信息收集、分析、通报和应急处置等方面进行合作，提高网络运营者的安全保障能力。有关行业组织建立健全本行业的网络安全保护规范和协作机制，加强对网络安全风险的分析评估，定期向会员进行风险警示，支持、协助会员应对网络安全风险。第三十条 网信部门和有关部门在履行网络安全保护职责中获取的信息，只能用于维护网络安全的需要，不得用于其他用途。第二节 关键信息基础设施的运行安全第三十一条 国家对公共通信和信息服务、能源、交通、水利、金融、公共服务、电子政务等重要行业和领域，以及其他一旦遭到破坏、丧失功能或者数据泄露，可能严重危害国家安全、国计民生、公共利益的关键信息基础设施，在网络安全等级保护制度的基础上，实行重点保护。关键信息基础设施的具体范围和安全保护办法由国务院制定。国家鼓励关键信息基础设施以外的网络运营者自愿参与关键信息基础设施保护体系。第三十二条 按照国务院规定的职责分工，负责关键信息基础设施安全保护工作的部门分别编制并组织实施本行业、本领域的关键信息基础设施安全规划，指导和监督关键信息基础设施运行安全保护工作。第三十三条 建设关键信息基础设施应当确保其具有支持业务稳定、持续运行的性能，并保证安全技术措施同步规划、同步建设、同步使用。第三十四条 除本法第二十一条的规定外，关键信息基础设施的运营者还应当履行下列安全保护义务：（一）设置专门安全管理机构和安全管理负责人，并对该负责人和关键岗位的人员进行安全背景审查；（二）定期对从业人员进行网络安全教育、技术培训和技能考核；（三）对重要系统和数据库进行容灾备份；（四）制定网络安全事件应急预案，并定期进行演练；（五）法律、行政法规规定的其他义务。第三十五条 关键信息基础设施的运营者采购网络产品和服务，可能影响国家安全的，应当通过国家网信部门会同国务院有关部门组织的国家安全审查。第三十六条 关键信息基础设施的运营者采购网络产品和服务，应当按照规定与提供者签订安全保密协议，明确安全和保密义务与责任。第三十七条 关键信息基础设施的运营者在中华人民共和国境内运营中收集和产生的个人信息和重要数据应当在境内存储。因业务需要，确需向境外提供的，应当按照国家网信部门会同国务院有关部门制定的办法进行安全评估；法律、行政法规另有规定的，依照其规定。第三十八条 关键信息基础设施的运营者应当自行或者委托网络安全服务机构对其网络的安全性和可能存在的风险每年至少进行一次检测评估，并将检测评估情况和改进措施报送相关负责关键信息基础设施安全保护工作的部门。第三十九条 国家网信部门应当统筹协调有关部门对关键信息基础设施的安全保护采取下列措施：（一）对关键信息基础设施的安全风险进行抽查检测，提出改进措施，必要时可以委托网络安全服务机构对网络存在的安全风险进行检测评估；（二）定期组织关键信息基础设施的运营者进行网络安全应急演练，提高应对网络安全事件的水平和协同配合能力；（三）促进有关部门、关键信息基础设施的运营者以及有关研究机构、网络安全服务机构等之间的网络安全信息共享；（四）对网络安全事件的应急处置与网络功能的恢复等，提供技术支持和协助。第四章 网络信息安全第四十条 网络运营者应当对其收集的用户信息严格保密，并建立健全用户信息保护制度。第四十一条 网络运营者收集、使用个人信息，应当遵循合法、正当、必要的原则，公开收集、使用规则，明示收集、使用信息的目的、方式和范围，并经被收集者同意。网络运营者不得收集与其提供的服务无关的个人信息，不得违反法律、行政法规的规定和双方的约定收集、使用个人信息，并应当依照法律、行政法规的规定和与用户的约定，处理其保存的个人信息。第四十二条 网络运营者不得泄露、篡改、毁损其收集的个人信息；未经被收集者同意，不得向他人提供个人信息。但是，经过处理无法识别特定个人且不能复原的除外。网络运营者应当采取技术措施和其他必要措施，确保其收集的个人信息安全，防止信息泄露、毁损、丢失。在发生或者可能发生个人信息泄露、毁损、丢失的情况时，应当立即采取补救措施，按照规定及时告知用户并向有关主管部门报告。第四十三条 个人发现网络运营者违反法律、行政法规的规定或者双方的约定收集、使用其个人信息的，有权要求网络运营者删除其个人信息；发现网络运营者收集、存储的其个人信息有错误的，有权要求网络运营者予以更正。网络运营者应当采取措施予以删除或者更正。第四十四条 任何个人和组织不得窃取或者以其他非法方式获取个人信息，不得非法出售或者非法向他人提供个人信息。第四十五条 依法负有网络安全监督管理职责的部门及其工作人员，必须对在履行职责中知悉的个人信息、隐私和商业秘密严格保密，不得泄露、出售或者非法向他人提供。第四十六条 任何个人和组织应当对其使用网络的行为负责，不得设立用于实施诈骗，传授犯罪方法，制作或者销售违禁物品、管制物品等违法犯罪活动的网站、通讯群组，不得利用网络发布涉及实施诈骗，制作或者销售违禁物品、管制物品以及其他违法犯罪活动的信息。第四十七条 网络运营者应当加强对其用户发布的信息的管理，发现法律、行政法规禁止发布或者传输的信息的，应当立即停止传输该信息，采取消除等处置措施，防止信息扩散，保存有关记录，并向有关主管部门报告。第四十八条 任何个人和组织发送的电子信息、提供的应用软件，不得设置恶意程序，不得含有法律、行政法规禁止发布或者传输的信息。电子信息发送服务提供者和应用软件下载服务提供者，应当履行安全管理义务，知道其用户有前款规定行为的，应当停止提供服务，采取消除等处置措施，保存有关记录，并向有关主管部门报告。第四十九条 网络运营者应当建立网络信息安全投诉、举报制度，公布投诉、举报方式等信息，及时受理并处理有关网络信息安全的投诉和举报。网络运营者对网信部门和有关部门依法实施的监督检查，应当予以配合。第五十条 国家网信部门和有关部门依法履行网络信息安全监督管理职责，发现法律、行政法规禁止发布或者传输的信息的，应当要求网络运营者停止传输，采取消除等处置措施，保存有关记录；对来源于中华人民共和国境外的上述信息，应当通知有关机构采取技术措施和其他必要措施阻断传播。第五章 监测预警与应急处置第五十一条 国家建立网络安全监测预警和信息通报制度。国家网信部门应当统筹协调有关部门加强网络安全信息收集、分析和通报工作，按照规定统一发布网络安全监测预警信息。第五十二条 负责关键信息基础设施安全保护工作的部门，应当建立健全本行业、本领域的网络安全监测预警和信息通报制度，并按照规定报送网络安全监测预警信息。第五十三条 国家网信部门协调有关部门建立健全网络安全风险评估和应急工作机制，制定网络安全事件应急预案，并定期组织演练。负责关键信息基础设施安全保护工作的部门应当制定本行业、本领域的网络安全事件应急预案，并定期组织演练。网络安全事件应急预案应当按照事件发生后的危害程度、影响范围等因素对网络安全事件进行分级，并规定相应的应急处置措施。第五十四条 网络安全事件发生的风险增大时，省级以上人民政府有关部门应当按照规定的权限和程序，并根据网络安全风险的特点和可能造成的危害，采取下列措施：（一）要求有关部门、机构和人员及时收集、报告有关信息，加强对网络安全风险的监测；（二）组织有关部门、机构和专业人员，对网络安全风险信息进行分析评估，预测事件发生的可能性、影响范围和危害程度；（三）向社会发布网络安全风险预警，发布避免、减轻危害的措施。第五十五条 发生网络安全事件，应当立即启动网络安全事件应急预案，对网络安全事件进行调查和评估，要求网络运营者采取技术措施和其他必要措施，消除安全隐患，防止危害扩大，并及时向社会发布与公众有关的警示信息。第五十六条 省级以上人民政府有关部门在履行网络安全监督管理职责中，发现网络存在较大安全风险或者发生安全事件的，可以按照规定的权限和程序对该网络的运营者的法定代表人或者主要负责人进行约谈。网络运营者应当按照要求采取措施，进行整改，消除隐患。第五十七条 因网络安全事件，发生突发事件或者生产安全事故的，应当依照《中华人民共和国突发事件应对法》、《中华人民共和国安全生产法》等有关法律、行政法规的规定处置。第五十八条 因维护国家安全和社会公共秩序，处置重大突发社会安全事件的需要，经国务院决定或者批准，可以在特定区域对网络通信采取限制等临时措施。第六章 法律责任第五十九条 网络运营者不履行本法第二十一条、第二十五条规定的网络安全保护义务的，由有关主管部门责令改正，给予警告；拒不改正或者导致危害网络安全等后果的，处一万元以上十万元以下罚款，对直接负责的主管人员处五千元以上五万元以下罚款。关键信息基础设施的运营者不履行本法第三十三条、第三十四条、第三十六条、第三十八条规定的网络安全保护义务的，由有关主管部门责令改正，给予警告；拒不改正或者导致危害网络安全等后果的，处十万元以上一百万元以下罚款，对直接负责的主管人员处一万元以上十万元以下罚款。第六十条 违反本法第二十二条第一款、第二款和第四十八条第一款规定，有下列行为之一的，由有关主管部门责令改正，给予警告；拒不改正或者导致危害网络安全等后果的，处五万元以上五十万元以下罚款，对直接负责的主管人员处一万元以上十万元以下罚款：（一）设置恶意程序的；（二）对其产品、服务存在的安全缺陷、漏洞等风险未立即采取补救措施，或者未按照规定及时告知用户并向有关主管部门报告的；（三）擅自终止为其产品、服务提供安全维护的。第六十一条 网络运营者违反本法第二十四条第一款规定，未要求用户提供真实身份信息，或者对不提供真实身份信息的用户提供相关服务的，由有关主管部门责令改正；拒不改正或者情节严重的，处五万元以上五十万元以下罚款，并可以由有关主管部门责令暂停相关业务、停业整顿、关闭网站、吊销相关业务许可证或者吊销营业执照，对直接负责的主管人员和其他直接责任人员处一万元以上十万元以下罚款。第六十二条 违反本法第二十六条规定，开展网络安全认证、检测、风险评估等活动，或者向社会发布系统漏洞、计算机病毒、网络攻击、网络侵入等网络安全信息的，由有关主管部门责令改正，给予警告；拒不改正或者情节严重的，处一万元以上十万元以下罚款，并可以由有关主管部门责令暂停相关业务、停业整顿、关闭网站、吊销相关业务许可证或者吊销营业执照，对直接负责的主管人员和其他直接责任人员处五千元以上五万元以下罚款。第六十三条 违反本法第二十七条规定，从事危害网络安全的活动，或者提供专门用于从事危害网络安全活动的程序、工具，或者为他人从事危害网络安全的活动提供技术支持、广告推广、支付结算等帮助，尚不构成犯罪的，由公安机关没收违法所得，处五日以下拘留，可以并处五万元以上五十万元以下罚款；情节较重的，处五日以上十五日以下拘留，可以并处十万元以上一百万元以下罚款。单位有前款行为的，由公安机关没收违法所得，处十万元以上一百万元以下罚款，并对直接负责的主管人员和其他直接责任人员依照前款规定处罚。违反本法第二十七条规定，受到治安管理处罚的人员，五年内不得从事网络安全管理和网络运营关键岗位的工作；受到刑事处罚的人员，终身不得从事网络安全管理和网络运营关键岗位的工作。第六十四条 网络运营者、网络产品或者服务的提供者违反本法第二十二条第三款、第四十一条至第四十三条规定，侵害个人信息依法得到保护的权利的，由有关主管部门责令改正，可以根据情节单处或者并处警告、没收违法所得、处违法所得一倍以上十倍以下罚款，没有违法所得的，处一百万元以下罚款，对直接负责的主管人员和其他直接责任人员处一万元以上十万元以下罚款；情节严重的，并可以责令暂停相关业务、停业整顿、关闭网站、吊销相关业务许可证或者吊销营业执照。违反本法第四十四条规定，窃取或者以其他非法方式获取、非法出售或者非法向他人提供个人信息，尚不构成犯罪的，由公安机关没收违法所得，并处违法所得一倍以上十倍以下罚款，没有违法所得的，处一百万元以下罚款。第六十五条 关键信息基础设施的运营者违反本法第三十五条规定，使用未经安全审查或者安全审查未通过的网络产品或者服务的，由有关主管部门责令停止使用，处采购金额一倍以上十倍以下罚款；对直接负责的主管人员和其他直接责任人员处一万元以上十万元以下罚款。第六十六条 关键信息基础设施的运营者违反本法第三十七条规定，在境外存储网络数据，或者向境外提供网络数据的，由有关主管部门责令改正，给予警告，没收违法所得，处五万元以上五十万元以下罚款，并可以责令暂停相关业务、停业整顿、关闭网站、吊销相关业务许可证或者吊销营业执照；对直接负责的主管人员和其他直接责任人员处一万元以上十万元以下罚款。第六十七条 违反本法第四十六条规定，设立用于实施违法犯罪活动的网站、通讯群组，或者利用网络发布涉及实施违法犯罪活动的信息，尚不构成犯罪的，由公安机关处五日以下拘留，可以并处一万元以上十万元以下罚款；情节较重的，处五日以上十五日以下拘留，可以并处五万元以上五十万元以下罚款。关闭用于实施违法犯罪活动的网站、通讯群组。单位有前款行为的，由公安机关处十万元以上五十万元以下罚款，并对直接负责的主管人员和其他直接责任人员依照前款规定处罚。第六十八条 网络运营者违反本法第四十七条规定，对法律、行政法规禁止发布或者传输的信息未停止传输、采取消除等处置措施、保存有关记录的，由有关主管部门责令改正，给予警告，没收违法所得；拒不改正或者情节严重的，处十万元以上五十万元以下罚款，并可以责令暂停相关业务、停业整顿、关闭网站、吊销相关业务许可证或者吊销营业执照，对直接负责的主管人员和其他直接责任人员处一万元以上十万元以下罚款。电子信息发送服务提供者、应用软件下载服务提供者，不履行本法第四十八条第二款规定的安全管理义务的，依照前款规定处罚。第六十九条 网络运营者违反本法规定，有下列行为之一的，由有关主管部门责令改正；拒不改正或者情节严重的，处五万元以上五十万元以下罚款，对直接负责的主管人员和其他直接责任人员，处一万元以上十万元以下罚款：（一）不按照有关部门的要求对法律、行政法规禁止发布或者传输的信息，采取停止传输、消除等处置措施的；（二）拒绝、阻碍有关部门依法实施的监督检查的；（三）拒不向公安机关、国家安全机关提供技术支持和协助的。第七十条 发布或者传输本法第十二条第二款和其他法律、行政法规禁止发布或者传输的信息的，依照有关法律、行政法规的规定处罚。第七十一条 有本法规定的违法行为的，依照有关法律、行政法规的规定记入信用档案，并予以公示。第七十二条 国家机关政务网络的运营者不履行本法规定的网络安全保护义务的，由其上级机关或者有关机关责令改正；对直接负责的主管人员和其他直接责任人员依法给予处分。第七十三条 网信部门和有关部门违反本法第三十条规定，将在履行网络安全保护职责中获取的信息用于其他用途的，对直接负责的主管人员和其他直接责任人员依法给予处分。网信部门和有关部门的工作人员玩忽职守、滥用职权、徇私舞弊，尚不构成犯罪的，依法给予处分。第七十四条 违反本法规定，给他人造成损害的，依法承担民事责任。违反本法规定，构成违反治安管理行为的，依法给予治安管理处罚；构成犯罪的，依法追究刑事责任。第七十五条 境外的机构、组织、个人从事攻击、侵入、干扰、破坏等危害中华人民共和国的关键信息基础设施的活动，造成严重后果的，依法追究法律责任；国务院公安部门和有关部门并可以决定对该机构、组织、个人采取冻结财产或者其他必要的制裁措施。第七章 附 则第七十六条 本法下列用语的含义：（一）网络，是指由计算机或者其他信息终端及相关设备组成的按照一定的规则和程序对信息进行收集、存储、传输、交换、处理的系统。（二）网络安全，是指通过采取必要措施，防范对网络的攻击、侵入、干扰、破坏和非法使用以及意外事故，使网络处于稳定可靠运行的状态，以及保障网络数据的完整性、保密性、可用性的能力。（三）网络运营者，是指网络的所有者、管理者和网络服务提供者。（四）网络数据，是指通过网络收集、存储、传输、处理和产生的各种电子数据。（五）个人信息，是指以电子或者其他方式记录的能够单独或者与其他信息结合识别自然人个人身份的各种信息，包括但不限于自然人的姓名、出生日期、身份证件号码、个人生物识别信息、住址、电话号码等。第七十七条 存储、处理涉及国家秘密信息的网络的运行安全保护，除应当遵守本法外，还应当遵守保密法律、行政法规的规定。第七十八条 军事网络的安全保护，由中央军事委员会另行规定。第七十九条 本法自2017年6月1日起施行。","tags":[{"name":"安全","slug":"安全","permalink":"//litten.me/tags/安全/"},{"name":"红线","slug":"红线","permalink":"//litten.me/tags/红线/"}]},{"title":"安全 全国高校电脑遭病毒绑架 5.10-5.13","date":"2017-05-13T02:36:00.000Z","path":"2017/05/13/diary-2017-0510-0513/","text":"​​​本周五，一次迄今为止最大规模的勒索病毒网络攻击席卷全球。据卡巴斯基统计，在过去的十几个小时里，全球共有74个国家的至少4.5万电脑中招。而杀毒软件Avast统计的数据更为惊人：病毒已感染全球至少5.7万台电脑，并仍在迅速蔓延中。截至13日凌晨，全球被该病毒感染的国家与地区。 在此提醒广大校园网用户： 为计算机安装最新的安全补丁，微软已发布补丁MS17-010修复了“永恒之蓝”攻击的系统漏洞，请尽快安装此安全补丁，网址为https://technet.microsoft.com/zh-cn/library/security/MS17-010。 关闭445、135、137、138、139端口，关闭网络共享。 强化网络安全意识：不明链接不要点击，不明文件不要下载，不明邮件不要打开。 尽快（今后定期）备份自己电脑中的重要文件资料到移动硬盘、U盘，备份完后脱机保存该磁盘。 建议仍在使用windows xp， windows 2003操作系统的用户尽快升级到window 7/windows 10，或windows 2008/2012/2016操作系统。 安装正版操作系统、Office软件等。","tags":[{"name":"安全","slug":"安全","permalink":"//litten.me/tags/安全/"}]},{"title":"旧事 曾经的愿望 4.10-4.16","date":"2017-04-16T02:36:00.000Z","path":"2017/04/16/diary-2017-0410-0416/","text":"当时想着考上研究生，就可以放下手中的笔，与键盘相依相伴，虚拟在线办公。把电脑当分为主系统娱乐和多个分系统独立的工作室。忘却一切烦恼与不安，去自己想去的地方看那些陌生的风景。 当计划被打乱，梦想被搁浅时，还要在凡间呆上一年，渡渡劫难 买台台式机，多买几个显示器，这样工作学习起来就方便多了，多装几个虚拟机，配置各种不同的环境，配远程，以后就可以完全的随时随地远程办公，最重要的是工作完后可以继续以一个孩子的心态去玩耍。可必须成熟，责任还有去承担，你是男生，没有任性的资本女生还可以随随便便找个工作，以后期望着婚姻能够改变命运，而男生，必须去担当了孩子的幼稚，想象力是许多成人都不具备的，网络时代亦如此鱼与熊掌不可兼得当你拿到offer时，却发现这个岗位你真的不喜欢，再坚持一年，一定坚持，时间到了，不管喜不喜欢，该干嘛干嘛 做每一个项目，你都能找到最快的方法，不读研，找工作我很难找的提升自己的机会,再考一年，如果再报西邮，就真的一点追求都没有，自己也没动力 二战西电的这一年你该如何度过？ 是想过去那样打打擦边球，然后用剩余时间去记录自己的一些关于计算机体系的一些想法还是沉浸于答案套路的海洋，我，没有选择 很遗憾没能读陈莉君老师的研究生 对不起她，机试面试都还算不错，期望着在她坛求道，聆听大师对计算机体系，大数据安全的理解，对内核的感悟，对哲学禅学等的一些心得体会。命运如此，能否扼住她的喉咙？以后做事情细心点，慢点，别一直为那些为那些闲余时间被浪费而感到遗憾。 做一个好吃懒做贪财好色的人不好吗 稳稳当当的 把自己应该做的事情先做完，然后再考虑自己喜欢做的。至少稳定点，只是可能会牺牲所谓的一些创新能力，但至少会变得稳定了许多，对家庭好。 还没到愿望实现的时候时 Back with silence","tags":[{"name":"旧事","slug":"旧事","permalink":"//litten.me/tags/旧事/"}]},{"title":"安全 计算机的各种端口关闭方法 2.10-3.09","date":"2016-03-09T02:36:00.000Z","path":"2016/03/09/diary-2016-0210-0309/","text":"有人曾经把服务器比作房子，而把端口比作通向不同房间（服务）的门，如果不考虑细节的话，这是一个不错的比喻。入侵者要占领这间房子，势必要破门而入（物理入侵另说），那么对于入侵者来说，了解房子开了几扇门，都是什么样的门，门后面有什么东西就显得至关重要。入侵者通常会用扫描器对目标主机的端口进行扫描，以确定哪些端口是开放的，从开放的端口，入侵者可以知道目标主机大致提供了哪些服务，进而猜测可能存在 的漏洞，因此对端口的扫描可以帮助我们更好的了解目标主机，而对于管理员，扫描本机的开放端口也是做好安全防范的第一步。​​​ 常见各端口： 关闭139端口的方法是在“网络和拨号连接”中“本地连接”中选取“Internet协议(TCP/IP)”属性，进入“高级TCP/IP设置”“WinS设置”里面有一项“禁用TCP/IP的NETBIOS”，打勾就关闭了139端口。 445端口的关闭:修改注册表，添加一个键值HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Services\\NetBT\\Parameters在右面的窗口建立一个SMBDeviceEnabled 为REG_DWORD类型键值为 0这样就ok了 135端口关闭方法 Windows XP系统运行dcomcnfg，展开“组件服务”→“计算机”，在“我的电脑”上点右键选“属性”，切换到“默认属性”，取消“启用分布式COM”；然后切换到“默认协议”，删除“面向连接的TCP/IP”。以上选项有对应的注册表键值，因此也可通过注册表来修改： HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Ole\\EnableDCOM的值改为“N” HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Rpc\\DCOM Protocols 中删除“ncacn_ip_tcp”此外，还需要停用“Distributed Transaction Coordinator”服务，重启之后， 135端口就没有了。Windows 2000系统前面的步骤和在XP下相同，只是需要多停用一个服务，“Task Scheduler”注意dcomcnfg的界面稍有不同，不过内容是一样的。Windows 2003以上方法在2003下无效，目前我只找到一个折中的方法。默认情况下，135端口是在所有地址上监听的，如果只在本机回环地址上监听，也不失为一种解决办法。要想改变135监听的地址，需要Windows Server 2003 Resource Kit tools中的rpccfg.exe。首先看一下网卡上都有哪些网段：rpccfg -l，一般情况下输出如下： 1 127.0.0.0 1 MS TCP Loopback interface 2 192.168.0.0 1 Realtek RTL8139/810x Family Fast Ethernet NIC然后输入；rpccfg -a 1。这样只有本机回环地址才开放135端口。 关闭23端口23端口主要用于Telnet（远程登录）服务，是Internet上普遍采用的登录和仿真程序。端口说明：23端口主要用于Telnet（远程登录）服务，是Internet上普遍采用的登录和仿真程序。同样需要设置客户端和服务器端，开启Telnet服务的客户端就可以登录远程Telnet服务器，采用授权用户名和密码登录。登录之后，允许用户使用命令提示符窗口进行相应的操作。在Windows中可以在命令提示符窗口中，键入“Telnet”命令来使用Telnet远程登录。操作建议：利用Telnet服务，黑客可以搜索远程登录Unix的服务，扫描操作系统的类型。而且在Windows 2000中Telnet服务存在多个严重的漏洞，比如提升权限、拒绝服务等，可以让远程服务器崩溃。Telnet服务的23端口也是TTS（Tiny Telnet Server）木马的缺省端口。所以，建议关闭23端口。","tags":[{"name":"安全","slug":"安全","permalink":"//litten.me/tags/安全/"}]},{"title":"安全 360云盘免费扩容100T空间 4.10-4.14","date":"2014-04-14T07:54:00.000Z","path":"2014/04/14/diary-2014-0410-0414/","text":"​​​云盘是一种专业的网络存储工具，随时随地的安全存放数据和重要资料。云盘相对于传统的实体磁盘来说，更方便，用户不需要把储存重要资料的实体磁盘带在身上。却一样可以通过互联网，轻松从云端读取自己所存储的信息。最近身边有好几个朋友让帮忙升级，终于闲了下来，下面教大家免费获得360云盘领100T免费空间。 简易教程： 打开浏览器，输入网址 http://sehd.360.cn/turntable/base/draw/?active=0434a1&amp;qid=XXXX 后面的XXXX表示的是32个十六进制数，要求大写并只要0-9 A-F 中随机32位值即可，比如我随意输的C5CA1ACBBBEFCAB299CD9B73E87C7B4A 修改好后直接回车，打开的网站中，找到卡号即可，一串大写的字母 如果出现下面情况，那就是XXX的与别人的重复，在修改下即可 找到卡号后，去360的“空间升级卡”，复制刚刚的卡号，升级即可","tags":[{"name":"安全","slug":"安全","permalink":"//litten.me/tags/安全/"}]},{"title":"Hello World","date":"2014-03-22T17:49:00.000Z","path":"2014/03/23/hello-world/","text":"在企鹅大神们的帮助下，这个localhost博客终于搭建起来了。 它像是属于自己的一块小小的领地，因而我满足于这种归属感。我愿在上面安静劳作。 Hello World ！ –对这个新世界的第一声问候。","tags":[{"name":"博客","slug":"博客","permalink":"//litten.me/tags/博客/"}]}]